<?php

$intro = [
    'CyclingFriendsは、ソーシャルネットワークでもあります。',
    '他ユーザー繋がる際、相互関係を持ち、承認を要する「友達」関係か、そうでない「フォロワー」関係かのどちらかを選択できます。',
    'あらゆる形で様々な地域に詳しいユーザーと繋がり、1人だけでは得られなかったコースや地域情報で次のツアーを企画したり、実際にツアーに応募して自転車を楽しみながら新たな仲間と出会ったりすることが、CyclingFriendsの醍醐味です。'
];

$content = [
    [
        'title' => '友達／フォロワーリスト',
        'path' => [
            'friends',
            'following'
        ],
        'text' => [
            '友達リストでは、他ユーザーから送られた友達リクエストと、友達関係を結んでいるユーザーの一覧が表示されます。',
            'フォロワーリストでは、自分がフォローしているユーザー（scouts）と、フォローしてくれているユーザー（followers）の一覧が表示されます。'
        ],
        'content' => [
            [
                'title' => 'フィルター',
                'text' => [
                    'ユーザー名を検索したり、並び順を変えたりできます。'
                ]
            ],
            [
                'title' => '申請リスト',
                'text' => [
                    '友達リストでは、申請リストが表示されます。友達申請のあったユーザーが表示されます。申請を承認または却下することができます。'
                ]
            ],
            [
                'title' => '友達／フォロワーリスト',
                'text' => [
                    '友達リストでは友達関係のあるユーザー、フォロワーリストではフォロワー関係のあるユーザーが表示されます。フォローしたり／辞めたり、友達申請を送ったり／友達関係を切ったりすることができます。'
                ]
            ]
        ]
    ]
];