<?php

$intro = [
    '個人情報に定義されているデータを除き、記入欄やファイルアップロードフォームを介してCyclingFriendsのサーバーにアップロードされたデータ、又はそのデータの自動集計／分析による第二次データの所有権はCyclingFriendsに属します。従って、CyclingFriendsは、下記のプライバシーポリシーに従って、データを自由に活用することができます。'
];

$content = [
    [
        'title' => 'はじめに',
        'id' => 'first',
        'text' => [
            '当社のプライバシーポリシー (以下、「プライバシーポリシー」) では、当社が収集する情報、情報の使用および共有方法、プライバシー設定の管理方法、当社ウェブサイト、関連するモバイルアプリケーションおよびサービスに関わる利用者の権利について説明します。',
            'CyclingFriendsは日本静岡県富士市に本社を置き、株式会社テラインコグニタより本サービスを提供しています。',
            '本プライバシーポリシーに関するご質問やご意見は、https://www.cyclingfriends.co/contactまでお送りください。'
        ]
    ],
    [
        'title' => 'CyclingFriendsが収集する情報',
        'id' => 'collectedData',
        'text' => [
            '利用者または他のユーザーの方が CyclingFriendsとの情報共有を選択した場合、CyclingFriendsは、利用者を直接的または間接的に特定する情報を含め、利用者に関する情報を収集します。利用者が本サービスを利用してアクティビティの追跡、完了またはアップロードを行う場合を含め、当社は様々な方法で情報を受け取ります。CyclingFriendsはまた、利用者による本サービスの使用状況に関する情報も収集します。利用者が自分自身やお友達、自身のアクティビティに関する情報をCyclingFriends と共有する機会もいくつかあります。その例は以下の通りです。'
        ],
        'content' => [
            [
                'title' => 'アカウント、プロフィール、アクティビティ、利用情報',
                'text' => [
                    '当社は、利用者によるサービス、アクセスを確保し、これを提供するために、基本的なアカウント情報 (名前、メールアドレス、生年月日、性別、ユーザーネーム、パスワードなど) を収集します。',
                    '写真、アクティビティとアクティビティに付随されるデータ (日付、時刻、位置情報、速度、写真、ストーリーの文言等)、他者のアクティビティの閲覧、あるいはその他の方法での本サービスの利用を選択された場合、プロフィール、アクティビティおよび利用情報が収集されます。',
                    '当社では、利用者のサポート依頼やコメントに対応できるように連絡先情報を使用します。'
                ]
            ],
            [
                'title' => '共有するコンテンツ',
                'text' => [
                    '当社は、利用者が絶景スポット、セグメントやその他の情報を作成したりする場合などに、写真、投稿、コメント、称賛、評価、レビュー、および本サービス上で共有するその他のコンテンツから情報を収集します。'
                ]
            ],
            [
                'title' => '他サービスのアカウントとの連携や同期',
                'text' => [
                    '他社が運営するサービスのアカウントをCyclingFriendsと連携や同期させる場合があります。その場合は、CyclingFriendsが処理し保有するデータは、そのサービスが提供するAPIに介して取得できる情報のみであり、徴収可能な情報に関してはそのサービスのプライバシーポリシーをご参照ください。'
                ]
            ],
            [
                'title' => '支払い情報',
                'text' => [
                    'CyclingFriendsに対して支払いを行う場合、利用者は、決済カードやその他の決済に関する詳細情報などの支払い情報を提供します。当社は、決済カード業界に適合した第三者決済サービスを利用しており、利用者のクレジットカード情報を保存しません。'
                ]
            ],
            [
                'title' => '技術情報およびログファイル',
                'text' => [
                    '当社は、利用者がサービスにアクセスしたりサービスを利用したりする際に、ご使用のブラウザ、コンピューター、またはモバイル機器から情報を収集することで、技術情報を入手します。この技術情報には、機器やネットワークに関する情報、ログファイル、分析情報などが含まれます。'
                ]
            ]
        ]
    ],
    [
        'title' => 'CyclingFriendsによる情報の使用方法',
        'id' => 'dataUsage',
        'text' => [
            'CyclingFriendsでは、以下に説明した通り、当社が収集し受領した情報を使用しています。'
        ],
        'content' => [
            [
                'title' => 'サービスの提供',
                'text' => [
                    '当社は、当社が収集し受領した情報を利用して本サービスを提供します。この際、当社では、利用者が以下を行えるようにします。',
                    '- 利用者のアクティビティを記録し、利用者が走行したコースなどを分析する。例えば、気温や速度等のデータや、コース中に含まれる絶景スポットやセグメントの走行回数や人気度など。',
                    '- 他のサイクリストと交流する。例えば、他のサイクリストのアクティビティに評価やコメントをしたり、他のサイクリストが作成した絶景スポットにレビューや評価をおこなったり、他のサイクリストをフォローや友達になったり、或いは活動拠点が近いユーザーを見つけ出したりすることができます。',
                    '- 利用者のアクティビティを新しい方法で視覚化する。例えば、パーソナルヒートマップを作成したり、利用者ご自身のトレーニングログを利用したりすることができます。'
                ]
            ],
            [
                'title' => '利用者エクスペリエンスの個別最適化',
                'text' => [
                    '当社は、利用者、利用者をフォローしているユーザー、アクティビティに関する情報を使って、利用者のエクスペリエンスを個別最適化します。例えば、当社は利用者が関心を抱きそうな絶景スポットやセグメントを提案し、利用者がフォローを希望するかも知れないサイクリストを提案し、さらに利用者が利用してみたいと思うような新しい機能を提案する場合があります。例えば、特定の地域でサイクリングしていることを知った場合には、その地域のセグメントを提案することもあります。'
                ]
            ],
            [
                'title' => '当社サービスの向上',
                'text' => [
                    '収集した情報は本サービスの分析、開発、改善にも使用されます。これを行うために、CyclingFriendsでは本サービスの利用状況を把握し、サービス向上に役立てるために、第三者の分析プロバイダーを利用する場合があります。'
                ]
            ],
            [
                'title' => '利用者とのコミュニケーション',
                'text' => [
                    '当社は、当社が収集する情報を利用し、利用者の要求やコメントに応えてサポートを提供します。',
                    'また当社は、収集した情報を使って、本サービス、CyclingFriends上でのアクティビティやイベント、その他の市販製品やサービスのマーケティングや販売促進を行うことがあります。'
                ]
            ],
            [
                'title' => '利用者サブスクリプションの処理',
                'text' => [
                    '当社は、当社が収集した情報を使用して利用者のサブスクリプションを処理します。'
                ]
            ],
            [
                'title' => '集約情報',
                'text' => [
                    '利用者の個人情報を販売することはありません。CyclingFriendsは、本サービスに関連して利用者やその他の人が提供した情報を集計して、一般公開したり第三者と共有したりする場合があります。当社が集約する情報には、利用状況、統計情報、ルート、時間データなどがあります。CyclingFriendsは、調査、ビジネス、あるいはサイクリングの改善などその他の目的のために、あるいはパートナーがサイクリスト（自社の製品やサービスの利用者を含む）についてよく理解できるようにするために、この集約情報を第三者と使用・共有したり、第三者に販売・ライセンス付与したりすることがあります。CyclingFriendsはまた、集約データを使用して、グローバルヒートマップの生成を目指しています。'
                ]
            ],
            [
                'title' => '情報の共有方法',
                'text' => [
                    '当社は、裁判所命令、令状、召喚状、またはその他の法的もしくは規制手続きに応じることを含め、そうした情報の開示が法律で認められている、あるいは法律を遵守する上で合理的に必要であると判断した場合、利用者の居住国内外において、利用者の情報を保存し、司法機関、公的機関もしくは行政機関、または民間係争者を含む第三者と利用者の情報を共有することがあります。当社は、あらゆる利用者の死亡または深刻な負傷を防ぐため、国の安全保障の問題や公的に重要なその他の問題に取り組むため、CyclingFriendsおよびそのユーザーによる詐欺行為や悪用を防止もしくは検知するため、または当社の法律顧問およびその他のコンサルタント、ならびに実際または潜在的な訴訟に関連する第三者への開示を含め、当社の事業、所有権、もしくはその他の法的権利を保護するため、これが合理的に必要または適切であると判断した場合、利用者の情報を保持、保存または開示することもあります。'
                ]
            ]
        ]
    ],
    [
        'title' => '情報の保護方法',
        'id' => 'dataProtection',
        'text' => [
            '当社では、収集、転送および保管するデータを保護するために、さまざまな対策を講じています。当社では、機密性に適した妥当な保護を利用者の情報に適用します。本サービスでは、業界標準のSSL（Secure Sockets Layer）テクノロジーを使用し、パスワード情報を暗号化しています。'
        ]
    ],
    [
        'title' => '設定の管理',
        'id' => 'privacySettings',
        'content' => [
            [
                'title' => '公開情報',
                'text' => [
                    'CyclingFriendsコミュニティに参加した利用者については、デフォルトでユーザーがプロフィールとアクティビティを閲覧できるように設定されています。利用者のユーザーネームやその他のプロフィール情報を他のCyclingFriendsユーザーや一般の人が閲覧できるようになります。例えば、CyclingFriendsユーザーが利用者の写真やアクティビティにアクセスできるようにしたり、一般の人々がアクセス可能なCyclingFriendsページや検索エンジンで閲覧可能にしたりすることもできます。',
                ]
            ],
            [
                'title' => 'プライバシー設定',
                'text' => [
                    'CyclingFriendsでは、利用者がプライバシーを管理し、アクティビティを共有できるように、複数の機能や設定を提供しています。',
                    '総合的なプライバシー設定は、アカウントの設定画面で変更することができます。アクティビティ、ライド、ルートやアクティビティに付随されている写真は、それぞれ作成する際に個別にプライバシー設定を変更することができます。',
                    '項目によって違う場合がありますが、基本的には、情報の公開範囲を「公開」、「友達のみ」、「非公開」の３段階の中で選択することができます。'
                ],
                'content' => [
                    [
                        'title' => '公開',
                        'text' => [
                            '誰でも観覧できます。'
                        ]
                    ],
                    [
                        'title' => '友達のみ／限定公開',
                        'text' => [
                            '友達として承認しているメンバーのみ回覧できます。それ以外のユーザーは回覧できません。'
                        ]
                    ],
                    [
                        'title' => '非公開',
                        'text' => [
                            '自分のみ回覧できます。'
                        ]
                    ],
                ]
            ],
            [
                'title' => '電子メールの受信設定',
                'text' => [
                    'マーケティングや販売促進のためのメールの末尾に記載されている手順に従って、配信停止の手続きを行うことができます。管理やサービスに関連するメール（購入確認、本プライバシーポリシーやサービス利用規約の更新など）は、利用者から依頼されたサービスの提供に必要であることから、通常、配信停止のオプションを提供していません。'
                ]
            ],
            [
                'title' => 'アカウント情報の更新',
                'text' => [
                    '利用者は、アカウント設定の情報を書き換えることで、プロフィールやアカウントの情報をいつでも訂正、修正または更新できます。誤った情報の訂正について詳しいサポートが必要な方は、https://www.cyclingfriends.co/contactよりCyclingFriendsまでお問い合わせください。'
                ]
            ],
            [
                'title' => 'アカウント情報の更新',
                'text' => [
                    '利用者は、アカウント設定の情報を書き換えることで、プロフィールやアカウントの情報をいつでも訂正、修正または更新できます。誤った情報の訂正について詳しいサポートが必要な方は、https://www.cyclingfriends.co/contactよりCyclingFriendsまでお問い合わせください。'
                ]
            ],
        ]
    ],
    [
        'title' => '情報の保持',
        'id' => 'dataConservation',
        'text' => [
            '当社は、利用者自身または他者に本サービスを提供する上で必要とされる期間にわたって情報を保持し、法律でそれ以上の期間にわたる情報の保持が求められている場合はそれを遵守します。アカウントに不随する情報は、一般的に、サービスを提供する必要がなくなるまであるいはアカウントが削除されるまで保持されます。また、アカウントを削除しなくても、一部の情報（プロフィール情報など）を削除したり、個別アクティビティをビューから削除したりすることができます。当社が保持する情報は、本プライバシーポリシーに準じて取り扱います。'
        ]
    ],
    [
        'title' => 'プライバシーポリシー情報',
        'id' => 'privacyPolicyInformation',
        'text' => [
            'CyclingFriendsは本プライバシーポリシーを随時変更できる権利を有します。こまめにご確認ください。CyclingFriendsが本プライバシーポリシーを改定した場合、最新版のプライバシーポリシーは適宜本サービス上に掲載されます。重大な変更が行われた場合は、目立つように掲示します。'
        ]
    ]
];